#include "DataModel.h"
//------------------------------------------------------------------------------------
//!
DataModel::DataModel(QObject *parent)
          :QObject(parent)
{
    setObjectName("DataModel");



    //-------------------------------------------------------------------
    SEND_TO_LOG( QString("%1 - создан").arg(objectName()) );
}
//------------------------------------------------------------------------------------
//!
DataModel::~DataModel()
{
    SEND_TO_LOG( QString("%1 - удален").arg(objectName()) );
}
//------------------------------------------------------------------------------------
//!
